WB/src/Documents/ВводДоходовИРасходов/ВводДоходовИРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДоходовИРасходов</name>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоходыИРасходы</name>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказыПокупателей</types>
      </type>
    </attributes>
    <attributes>
      <name>КарточкаТовара</name>
      <type>
        <types>CatalogRef.КарточкиТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>CatalogRef.РазмерыКарточекТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Статья</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WB/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Продавцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КарточкаТовара</name>
    <type>
      <types>CatalogRef.КарточкиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размер</name>
    <type>
      <types>CatalogRef.РазмерыКарточекТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказыПокупателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

WB/src/Enums/ВидыСтатей/ВидыСтатей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтатей</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

WB/src/Documents/ВводДоходовИРасходов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ДоходыИРасходы
	Движения.ДоходыИРасходы.Записывать = Истина;
	
	Для Каждого ТекСтрокаДоходыИРасходы Из ДоходыИРасходы Цикл
		Движение = Движения.ДоходыИРасходы.Добавить();
		Движение.Период = Дата;
		Движение.Продавец = Продавец;
		Движение.КарточкаТовара = ТекСтрокаДоходыИРасходы.КарточкаТовара;
		Движение.Размер = ТекСтрокаДоходыИРасходы.Размер;
		Движение.ЗаказПокупателя = ТекСтрокаДоходыИРасходы.ЗаказПокупателя;
		Движение.Статья = ТекСтрокаДоходыИРасходы.Статья;
		
		Если Движение.Статья.ВидСтатьи = Перечисления.ВидыСтатей.Доход Тогда
			Движение.СуммаДохода = ТекСтрокаДоходыИРасходы.Сумма;
		ИначеЕсли Движение.Статья.ВидСтатьи = Перечисления.ВидыСтатей.Расход Тогда
			Движение.СуммаРасхода = ТекСтрокаДоходыИРасходы.Сумма;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
